gkgkfndudals/Hustar/Cortex_stm32F4xx/0810/test/src/main.c
/*
 * This file is part of the µOS++ distribution.
 *   (https://github.com/micro-os-plus)
 * Copyright (c) 2014 Liviu Ionescu.
 *
 * Permission is hereby granted, free of charge, to any person
 * obtaining a copy of this software and associated documentation
 * files (the "Software"), to deal in the Software without
 * restriction, including without limitation the rights to use,
 * copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom
 * the Software is furnished to do so, subject to the following
 * conditions:
 *
 * The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
 * HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
 * WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 */

// ----------------------------------------------------------------------------
#include <stdio.h>
#include <stdlib.h>
#include "diag/Trace.h"

#include "Timer.h"
#include "BlinkLed.h"

#include "stm32f4xx.h"
// ----------------------------------------------------------------------------
//
// Standalone STM32F4 led blink sample (trace via ITM).
//
// In debug configurations, demonstrate how to print a greeting message
// on the trace device. In release configurations the message is
// simply discarded.
//
// Then demonstrates how to blink a led with 1 Hz, using a
// continuous loop and SysTick delays.
//
// Trace support is enabled by adding the TRACE macro definition.
// By default the trace messages are forwarded to the ITM output,
// but can be rerouted to any device or completely suppressed, by
// changing the definitions required in system/src/diag/trace_impl.c
// (currently OS_USE_TRACE_ITM, OS_USE_TRACE_SEMIHOSTING_DEBUG/_STDOUT).
//

// ----- Timing definitions -------------------------------------------------

// Keep the LED on for 2/3 of a second.
#define BLINK_ON_TICKS  (TIMER_FREQUENCY_HZ * 3 / 4)
#define BLINK_OFF_TICKS (TIMER_FREQUENCY_HZ - BLINK_ON_TICKS)

// ----- main() ---------------------------------------------------------------

// Sample pragmas to cope with warnings. Please note the related line at
// the end of this function, used to pop the compiler diagnostics status.
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"
#pragma GCC diagnostic ignored "-Wmissing-declarations"
#pragma GCC diagnostic ignored "-Wreturn-type"

#define RCC_AHB1ENR (*(volatile unsigned long*)0x40023830)
#define GPIOC_MODER (*(volatile unsigned long*)0x40020800)
#define GPIOC_OTYPER (*(volatile unsigned long*)0x40020804)
#define GPIOC_OSPEEDR (*(volatile unsigned long*)0x40020808)
#define GPIOC_PUPDR (*(volatile unsigned long*)0x4002080C)
#define GPIOC_ODR (*(volatile unsigned long*)0x40020814)

void ms_delay_int_count(volatile unsigned int nTime){
	nTime= (nTime * 14000);
	for(;nTime>0;nTime--);
}
int main(int argc, char* argv[]) {
	RCC -> AHB1ENR = 0x3;
	GPIOA-> MODER |=0x00001000;
	GPIOA-> OTYPER = 0;
	GPIOA -> PUPDR = 0;
	GPIOA -> OSPEEDR= 0;


	GPIOB->MODER = 0x00005000;
	GPIOB -> OTYPER = 0;
	GPIOB -> PUPDR =0;
	GPIOB -> OSPEEDR =0;
	GPIOA ->ODR=0x0040;

//	RCC->AHB1ENR = 0X00000004;
//	GPIOC->MODER = 0X00000010;
//	GPIOC->OTYPER = 0;
//	GPIOC->PUPDR = 0;
//	GPIOC->OSPEEDR = 0;
	// Infinite loop
	while (1) {
		GPIOB->ODR = 0x0040;
		ms_delay_int_count(1000);
		GPIOB->ODR=0x0000;
		ms_delay_int_count(1000);
//		GPIOC->ODR = 0x0004;
//		ms_delay_int_count(100);
//		GPIOC->ODR = 0x0000;
//		ms_delay_int_count(100);
	}
	// Infinite loop, never return.
}

#pragma GCC diagnostic pop

// ----------------------------------------------------------------------------
